<template>
  <div class="my-[25px]">
    <h1 class="text-[30px] font-bold">
      Добро пожаловать в наш магазин строительных материалов!
    </h1>
    <div class="pt-[25px]">
      <p>
        Мы рады предложить вам широкий ассортимент качественных строительных
        материалов, необходимых для вашего строительного проекта. Наш магазин
        специализируется на предоставлении клиентам только самых надежных и
        инновационных материалов от ведущих производителей в отрасли.
      </p>
      <h1 class="text-[30px] font-bold pt-[30px]">В чем наша особенность?</h1>

      <ol
        class="space-y-4 text-gray-500 list-decimal list-inside dark:text-gray-400 text-[20px] pt-[25px]"
      >
        <li>
          Большой выбор:
          <ul class="pl-5 mt-2 space-y-1 list-disc list-inside">
            <li>
              Мы предлагаем широкий ассортимент строительных материалов, включая
              различные виды кирпича, цемент, изоляционные материалы, арматуру,
              сухие смеси, кровельные материалы, электрические компоненты и
              многое другое. У нас вы найдете все необходимое для успешного
              завершения вашего строительного проекта.
            </li>
          </ul>
        </li>
        <li>
          Качество и надежность
          <ul class="pl-5 mt-2 space-y-1 list-disc list-inside">
            <li>
              Мы тщательно отбираем наших поставщиков и работаем только с
              проверенными и надежными производителями. Все наши строительные
              материалы соответствуют высоким стандартам качества и гарантируют
              долговечность и надежность вашей конструкции.
            </li>
          </ul>
        </li>
        <li>
          Профессиональные консультации
          <ul class="pl-5 mt-2 space-y-1 list-disc list-inside">
            <li>
              Наша команда экспертов всегда готова помочь вам с выбором
              правильных материалов в соответствии с вашими потребностями и
              бюджетом. Мы предоставляем профессиональные консультации и
              рекомендации, чтобы помочь вам принять взвешенное решение и
              достичь оптимальных результатов.
            </li>
          </ul>
        </li>

        <li>
          Удобство покупок:
          <ul class="pl-5 mt-2 space-y-1 list-disc list-inside">
            <li>
              Мы стремимся обеспечить максимальный комфорт для наших клиентов. У
              нас вы можете с легкостью выбрать и приобрести необходимые
              строительные материалы. Кроме того, мы предлагаем удобные условия
              доставки, чтобы ваши покупки были еще более удобными и
              безопасными.
            </li>
          </ul>
        </li>
        <li>
          Конкурентные цены
          <ul class="pl-5 mt-2 space-y-1 list-disc list-inside">
            <li>
              Мы предлагаем конкурентоспособные цены на все наши строительные
              материалы. Мы понимаем, что строительство может быть дорогим
              процессом, поэтому мы стремимся предложить выгодные цены без
              компромисса в качестве.
            </li>
          </ul>
        </li>
        <li>
          Онлайн-покупки
          <ul class="pl-5 mt-2 space-y-1 list-disc list-inside">
            <li>
              Мы предоставляем возможность совершать покупки строительных
              материалов онлайн через наш веб-сайт. Вы можете легко просмотреть
              наш каталог, выбрать нужные товары, оформить заказ и получить его
              удобным для вас способом.
            </li>
          </ul>
        </li>
      </ol>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped></style>
