import {
    createApp
} from 'vue'
import './style.css'
import App from './App.vue'
import router from './router/router'
import {
    createI18n
} from 'vue-i18n'


const i18n = createI18n({
    locale: 'ru',
    fallbackLocale: 'kz',
    messages: {
        ru: {
            header: {
                login: 'Войти',
                reg: 'Регистрация',
                leave: 'Выход',
                Favorit: 'Избранные',
                about: 'О компании',
                catalog: 'Каталог',
                discount: 'Акции',
                hit: 'Хит сезона',
                New: 'Новинки',
                basket: 'Корзина',
                hitText: 'Отличные предложения: хиты сезона в магазине строительных материалов!',
                time: 'Время работы',
                addres: 'Наш адрес',
                title: 'Контакты'

            },
            topCard: {
                card1: 'DeWALT - Инструмент с настоящим характером',
                card2: 'Акции',
                card3: 'Новое поступление',
                card4: 'Хиты сезона'
            },
            slider: {
                Painting: 'Малярные товары',
                Workwear: 'Спецодежда',
                hag: 'Для дома и дачи',
                elec: 'Электрооборудование',
                brend: 'Наши бренды'

            },
            news: {
                title: "Новости",
                titleText: 'Торговое или промышленное предприятие, торгово-промышленное объединение предпринимателей, форма организации предприятия, при которой его правосубъектность отличается от правосубъектности лиц, в нем участвующих. Компании имеют статус юридического лица.',
                text1: 'Новая технология революционирует строительную индустрию: инновационные материалы будущего',
                text2: 'Умный бетон: революционная технология для надежных конструкций',
                text3: 'Графен в строительстве: будущее здесь',
                text4: 'Экологически чистые изоляционные материалы: комфорт и безопасность в каждом доме'
            },
            aboutTeam: {
                title: 'О нас',
                titleText: '  объединение предпринимателей, форма организации предприятия, при которой его правосубъектность отличается от правосубъектности лиц, в нем участвующих.',
                titleText1: "Торговое или промышленное предприятие, торгово-промышленное объединение предпринимателей, форма организации предприятия",
            },
            about: {
                title: 'Добро пожаловать в наш магазин строительных материалов!',
                titleText: 'Мы рады предложить вам широкий ассортимент качественных строительных материалов, необходимых для вашего строительного проекта. Наш магазин специализируется на предоставлении клиентам только самых надежных и инновационных материалов от ведущих производителей в отрасли.',
                title2: 'В чем наша особенность?',
                list1: 'Большой выбор:',
                list1text: 'Мы предлагаем широкий ассортимент строительных материалов, включая различные виды кирпича, цемент, изоляционные материалы, арматуру, сухие смеси, кровельные материалы, электрические компоненты и многое другое. У нас вы найдете все необходимое для успешного завершения вашего строительного проекта.',
                list2: 'Качество и надежность',
                list2text: 'Мы тщательно отбираем наших поставщиков и работаем только с проверенными и надежными производителями. Все наши строительные материалы соответствуют высоким стандартам качества и гарантируют долговечность и надежность вашей конструкции.',
                list3: 'Профессиональные консультации',
                list3text: 'Наша команда экспертов всегда готова помочь вам с выбором правильных материалов в соответствии с вашими потребностями и бюджетом. Мы предоставляем профессиональные консультации и рекомендации, чтобы помочь вам принять взвешенное решение и достичь оптимальных результатов.',
                list4: 'Удобство покупок:',
                list4text: 'Мы стремимся обеспечить максимальный комфорт для наших клиентов. У нас вы можете с легкостью выбрать и приобрести необходимые строительные материалы. Кроме того, мы предлагаем удобные условия доставки, чтобы ваши покупки были еще более удобными и безопасными.',
                list5: 'Конкурентные цены',
                list5text: "Мы предлагаем конкурентоспособные цены на все наши строительные материалы. Мы понимаем, что строительство может быть дорогим процессом, поэтому мы стремимся предложить выгодные цены без компромисса в качестве.",
                list6: 'Онлайн-покупки',
                list6text: 'Мы предоставляем возможность совершать покупки строительных материалов онлайн через наш веб-сайт. Вы можете легко просмотреть наш каталог, выбрать нужные товары, оформить заказ и получить его удобным для вас способом.'
            },
            fotter: {
                tool: 'ИНСТРУМЕНТЫ',
                about: 'О КОМПАНИИ',
                contact: 'Контакты',
                new: 'Новинки',
                aboutCom: 'О компани',



            },
            infoCard: {
                quant: 'В наличии',
                join: 'Войдите, чтобы купить',
                like: 'Нравится',
                text: 'Описание',
                del: 'Доставка',
                otzvL: 'Отзывы',
                pohozh: 'Похожие товары',
                pay: 'Купить'

            },
            reg: {
                email: 'Электронная почта',
                pas: 'Пароль',
                name: 'Имя',
                lastName: 'Фамилия',
                title: 'РегистрацияТіркеу',
                join: 'Войти'
            }

        },
        kz: {
            header: {
                login: 'Кіру',
                reg: 'Тіркеу',
                leave: 'Шығу',
                Favorit: 'Таңдаулылар',
                about: 'Компания туралы',
                catalog: 'Каталог',
                discount: 'Акциялар',
                hit: 'Маусымның хиті',
                New: 'Жаңа',
                basket: 'Себет',
                hitText: 'Керемет ұсыныстар: құрылыс материалдары дүкеніндегі маусымдық хиттер!',
                time: 'Жұмыс уақыты',
                addres: 'Біздің мекен-жайымыз',
                title: 'Байланыстар'
            },
            topCard: {
                card1: 'DeWALT-нақты сипаты бар құрал',
                card2: 'Акции',
                card3: 'Жаңа қабылдау',
                card4: 'Маусымның хиттері'
            },
            slider: {
                Painting: 'Бояу өнімдері',
                Workwear: 'Арнайы киім',
                hag: 'Үй мен саяжай үшін',
                elec: 'Электр жабдықтары',
                brend: ' Біздің брендтер'

            },
            news: {
                title: "Жаңалықтар",
                titleText: 'Сауда немесе өнеркәсіптік кәсіпорын, кәсіпкерлердің сауда-өнеркәсіптік бірлестігі, оның заңды тұлғасы оған қатысатын тұлғалардан ерекшеленетін кәсіпорынды ұйымдастыру нысаны. Компаниялар заңды тұлға мәртебесіне ие.',
                text1: 'Жаңа технология құрылыс индустриясында төңкеріс жасайды: болашақтың инновациялық материалдары',
                text2: 'Ақылды бетон: сенімді құрылымдарға арналған революциялық технология',
                text3: 'Графен құрылыста: болашақ осында',
                text4: 'Экологиялық таза оқшаулағыш материалдар: әр үйдегі жайлылық пен қауіпсіздік'
            },
            aboutTeam: {
                title: 'Біз туралы',
                titleText: '  кәсіпкерлердің бірлестігі, оның заңды тұлғасы оған қатысатын тұлғалардан ерекшеленетін кәсіпорынды ұйымдастыру нысаны.',
                titleText1: "Сауда немесе өнеркәсіптік кәсіпорын, кәсіпкерлердің сауда-өнеркәсіптік бірлестігі, кәсіпорынды ұйымдастыру нысаны",
            },
            about: {
                title: 'Біздің құрылыс материалдары дүкеніне қош келдіңіз!',
                titleText: 'Біз сізге құрылыс жобаңызға қажетті сапалы құрылыс материалдарының кең ауқымын ұсынуға қуаныштымыз. Біздің дүкен клиенттерге саладағы жетекші өндірушілердің ең сенімді және инновациялық материалдарын ұсынуға маманданған.',
                title2: 'Біздің ерекшелігіміз неде?',
                list1: 'Үлкен таңдау:',
                list1text: 'Біз әртүрлі кірпіш, цемент, оқшаулағыш материалдар, арматура, құрғақ қоспалар, шатыр материалдары, электр компоненттері және т.б. қоса алғанда, құрылыс материалдарының кең ауқымын ұсынамыз. Бізде сіз құрылыс жобаңызды сәтті аяқтау үшін қажет нәрсенің бәрін таба аласыз.',
                list2: 'сапа және сенімділік',
                list2text: 'біз жеткізушілерімізді мұқият таңдаймыз және тек сенімді және сенімді өндірушілермен жұмыс жасаймыз. Біздің барлық құрылыс материалдары жоғары сапа стандарттарына сәйкес келеді және сіздің дизайныңыздың беріктігі мен сенімділігіне кепілдік береді.',
                list3: 'кәсіби кеңес',
                list3text: 'біздің сарапшылар тобы әрқашан сіздің қажеттіліктеріңізге және бюджетіңізге сәйкес дұрыс материалдарды таңдауға көмектесуге дайын. Біз сізге дұрыс шешім қабылдауға және оңтайлы нәтижелерге қол жеткізуге көмектесетін кәсіби кеңестер мен нұсқаулар береміз.',
                list4: 'сатып алу ыңғайлылығы:',
                list4text: 'біз өз клиенттеріміз үшін барынша жайлылықты қамтамасыз етуге тырысамыз. Бізден сіз қажетті құрылыс материалдарын оңай таңдап, сатып ала аласыз. Сонымен қатар, біз сіздің сатып алуларыңызды одан да ыңғайлы және қауіпсіз ету үшін ыңғайлы жеткізу шарттарын ұсынамыз.',
                list5: 'бәсекеге қабілетті бағалар',
                list5text: "біз барлық құрылыс материалдарымызға бәсекеге қабілетті баға ұсынамыз. Біз құрылыс қымбат процесс болуы мүмкін екенін түсінеміз, сондықтан біз сапаға безасыз қолайлы бағаларды ұсынуға тырысамыз.",
                list6: 'Онлайн сатып алу',
                list6text: 'біз веб-сайтымыз арқылы құрылыс материалдарын онлайн сатып алуға мүмкіндік береміз. Сіз біздің каталогты оңай көре аласыз, қажетті заттарды таңдай аласыз, тапсырыс бере аласыз және оны өзіңізге ыңғайлы түрде ала аласыз.'
            },
            fotter: {
                tool: 'Құралдар',
                about: 'КОМПАНИЯ ТУРАЛЫ',
                contact: 'Байланыс',
                new: 'Жаңа',
                aboutCom: 'Компания туралы',



            },
            infoCard: {
                pay: 'Сатып алу',

                quant: 'Қолда бар',
                join: 'Сатып алу үшін кіріңіз',
                like: 'Ұнайды',
                text: 'Сипаттама',
                del: 'Жеткізу',
                otzvL: 'Пікірлер',
                pohozh: 'Ұқсас тауарлар'
            },
            reg: {
                email: 'Электрондық пошта',
                pas: 'Құпия сөз',
                name: 'Аты',
                lastName: 'Тегі',
                title: 'Тіркеу',
                join: 'Кіру'
            }
        },
    }
})
createApp(App).use(router).use(i18n).mount('#app')